# SetFPatByClass

## Description
Procedure SetFPatByClass sets the referenced object to use the class attribute fill pattern.

```pascal
PROCEDURE SetFPatByClass(h : HANDLE);
```

```python

def vs.SetFPatByClass(h):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|h|HANDLE|Handle to object.|

## Remarks
Sets so that the class fill pattern is used for the object referenced by h.<BR>
[sd 8/19/98]

## Version
Availability: from VectorWorks8.0
## Category
* Object Attributes